---
layout: post
title: "Hello Maven"
date: 2013-07-02 21:56:26
categories: maven, java
---
<p>
<iframe width="560" height="315" src="//www.youtube.com/embed/4W5KhfJHF_4" frameborder="0" allowfullscreen></iframe></p>
<p>
	There&#39;s two ways to go on this job: my way or the highway.<br />
	Ese podr&iacute;a ser el lema de Maven, o como dec&iacute;a la versi&oacute;n traducida de Reservoir Dogs<br />
	&quot;Hay dos formas de hacer el trabajo, la m&iacute;a o la puta calle.&quot;<br />
	<br />
	Comienzo con esa cita porque, para qu&eacute; nos vamos a enga&ntilde;ar, esa escena es genial y esa es la t&iacute;pica frase que a veces nos vemos tentados a soltar pero no hacemos por ser correctos. Maven es un poco as&iacute;, te obliga a hacer las cosas a su manera, pero todo es por tu bien.</p>
<p>
	<br />
	Si bien se puede personalizar su forma de funcionar la gente que lo usa te sugiere que mejor no empe&ntilde;arse en retorcerlo a nuestro gusto.<br />
	Deja que Maven conduzca...<br />
	<br />
	La estructura de directorios de un proyecto Maven ser&iacute;a as&iacute;, no hay que hacerla a mano te la puede generar el propio<br />
	Maven o un IDE.<br />
	<br />
	<span style="font-family:courier new,courier,monospace;">Proyecto/pom.xml<br />
	Proyecto/src<br />
	Proyecto/src/main<br />
	Proyecto/src/main/java/Hola.java<br />
	Proyecto/src/main/resources<br />
	Proyecto/src/test</span><br />
	<br />
	Tras ejecutar <span style="font-family:courier new,courier,monospace;">mvn install</span>, se ejecutar&iacute;an las siguientes tareas por defecto: procesar recursos si los hubiera, compilar c&oacute;digo, compilar y pasar test unitarios si las hubiero, generar un fichero jar e instalarlo en el repositorio local para que otros proyectos lo usen.</p>
<p>
	En el proyecto se generar&iacute;a la carpeta Target con el resultado:<br />
	<br />
	<span style="font-family:courier new,courier,monospace;">Proyecto/target<br />
	Proyecto/target/Hola-1.0.jar<br />
	Proyecto/target/classes/Hola.class</span><br />
	<br />
	El contenido del fichero pom.xml es el siguiente, muy m&iacute;nimo:<br />
	<span style="font-family:courier new,courier,monospace;"><project><br />
	<modelversion>4.0.0</modelversion><br />
	<groupid>info.pello.maven.hellomaven</groupid><br />
	<artifactid>00HelloMaven</artifactid><br />
	<version>1.0</version><br />
	</project></span><br />
	<br />
	Maven es mucho m&aacute;s que una herramienta para automatizar la compilaci&oacute;n de c&oacute;digo. Se considera como una herramiento para gestionar proyectos de software. Aunque en un primer vistazo nos encontramos con un fichero xml y un comando que pone todo en marcha (como ant), Maven va mucho m&aacute;s all&aacute;. Partiendo<br />
	de un interfaz &uacute;nico Maven es capaz de resolver las dependencias&nbsp; de los componentes del proyecto y reutiliza infinidad de plugins para resolver cualquier tarea.<br />
	<br />
	La base de Maven es muy peque&ntilde;a pero sin embargo seg&uacute;n las tareas que se le requieran de forma autom&aacute;tica se descarga todos los plugins necesario de un repositorio central a uno local. La mayor parte de las tareas de Maven la realizan esos plugins.<br />
	<br />
	Los IDEs tienen soporte para crear proyectos basados en Maven. Netbeans desde hace m&aacute;s tiempo que Eclipse, que por fin<br />
	en la versi&oacute;n Kepler parece traer proyectos Maven de serie. Y si es una forma unificada de configurar un poryecto, solamente por eso merece la pena usarlo.</p>
