---
layout: post
title: "Proyecto startupweb"
date: 2013-07-20 21:27:19
categories: projects, php
---
<p>
	&nbsp;</p>
<div>
	<a href="http://code.google.com/p/startupweb/" target="_blank"><img alt="Logo startupweb" src="http://code.google.com/p/startupweb/logo?cct=1369993492" style="width: 55px; height: 55px; " /></a></div>
<div>
	<a href="http://code.google.com/p/startupweb/">P&aacute;gina del proyecto en google code.</a></div>
<div>
	&nbsp;</div>
<div>
	M&aacute;s de una vez he querido desarrollar una p&aacute;gina web para distintas cosas, y normalmente como son cosas raras no puedo echar manos de un CRM as&iacute; que tengo que iniciarlas de 0 (cosa que tambi&eacute;n gusta para que nos vamos a enga&ntilde;ar).</div>
<div>
	&nbsp;</div>
<div>
	El caso es que siempre me topaba con el mismo rollo: a ver voy a hacer una p&aacute;gina y me tengo que enfrentar al problema de registros de usuarios. Lo que me gustar&iacute;a tener es lo siguiente:</div>
<div>
	- Que est&eacute; hecho en php/mysql. Y ya que estamos que use un framework, pero ligerito.</div>
<div>
	- Quitarme de encima la gesti&oacute;n de altas/validaci&oacute;n/recuperaci&oacute;n de cuentas. Otra vez no por favor.</div>
<div>
	- Pasar esa gesti&oacute;n a otros sitios en los que el usuario va a confiar mucho m&aacute;s que en un web rara.</div>
<div>
	&nbsp;</div>
<div>
	&iexcl;No problemo! Existe un proyecto llamado <a href="http://hybridauth.sourceforge.net/">hybridauth</a> que nos ofrece todo lo necesario para validarnos contra los grandes sitios como Google, Facebook, yahoo, live, twitter, etc... Y lo que es mejor, es compatible con <a href="http://ellislab.com/codeigniter">Codeigniter</a>, el &nbsp;framework php of (my) choice.&nbsp;</div>
<div>
	&nbsp;</div>
<div>
	Codeigniter + Hybridauth... ummm el caso es que ya existe algo as&iacute;: <a href="https://github.com/andacata/HybridIgniter ">hybridigniter</a>. Pero en mi caso quer&iacute;a meter algunas cosas m&aacute;s de serie: la librer&iacute;a jquery y ya que estamos el bootstrap. Al final, startupweb contiene todo eso m&aacute;s el controlador+modelo que se ocupa del login. Vamos, que si quieres no montar, m&aacute;s bien <strong>iniciar</strong> un site que ya tenga solucionado el problema de los usuarios, con una plantilla web sencilla y que funciona en todas partes, ya la tienes. En concreto tiene:</div>
<ul>
	<li>
		codeigniter 2.1.3</li>
	<li>
		hybridauth 2.1.2</li>
	<li>
		bootstrap 2.3.2</li>
	<li>
		jquery-1.10.1</li>
	<li>
		jquery-ui-1.10.3</li>
</ul>
<div>
	&nbsp;</div>
<div>
	Si te descargas <em>startupweb</em> te quedar&iacute;a lo siguiente:</div>
<div>
	1.editar la configuraci&oacute;n de la BB: application/config/database.php</div>
<div>
	2.editar la configuraci&oacute;n de HybridAuth: application/config/hybridauthlib.php</div>
<div>
	&nbsp;</div>
<div>
	Esa es la parte m&aacute;s engorrosa, pero por el tema administrativo: por cada sitio en el que vas a permitir que los usuarios se validen tendr&aacute;s que dar de alta tu web. En cada uno es distinto, pero los datos que te acaban facilitando son similares: una url y una serie de claves.</div>
<div>
	&nbsp;</div>
<div>
	Una vez hecho eso, ya tienes el site iniciado y ya puedes programar tu web sobre Codeigniter, un framework potente y sobre todo muy ligero. Se basa en convenciones, as&iacute; que basicamente tienes que preocuparte de colocar los ficheros en determinados directorios y nombrarlos de determinadas maneras. Nada de ficheros xml como el Spring.</div>
<div>
	&nbsp;</div>
<div>
	Para predicar con el ejemplo, una de las tareas pendientes del est&iacute;o es pasar pello.info a startupweb. As&iacute; que cualquier d&iacute;a &nbsp;de estos cambiar&aacute; el aspecto de la p&aacute;gina.</div>
